0wQ/CH32X035-PD-Tester/lib/usb_pd/usbpd_sink.c
#include "usbpd_sink.h"
#include "usbpd_def.h"
#include "usbpd_rdo.h"

#include <stdint.h>
#include "ch32x035.h"
#include "utils_print.h"
#include "utils_delay.h"

/******************************************************************************
 * Static Variables
 *****************************************************************************/

static pd_control_t pd_control_g;
static uint8_t usbpd_rx_buffer[USBPD_DATA_MAX_LEN] __attribute__((aligned(4)));
static uint8_t usbpd_tx_buffer[USBPD_DATA_MAX_LEN] __attribute__((aligned(4)));

/******************************************************************************
 * Basic Function
 *****************************************************************************/

static USBPD_CC_State_t usbpd_sink_check_cc_connect(void) {
    USBPD_CC_State_t ccLine = USBPD_CCNONE;

    USBPD->PORT_CC1 &= ~(CC_CMP_Mask | PA_CC_AI);
    USBPD->PORT_CC1 |= CC_CMP_22;
    delay_us(2);
    if (USBPD->PORT_CC1 & PA_CC_AI) {
        ccLine = USBPD_CC1;
    }

    USBPD->PORT_CC2 &= ~(CC_CMP_Mask | PA_CC_AI);
    USBPD->PORT_CC2 |= CC_CMP_22;
    delay_us(2);
    if (USBPD->PORT_CC2 & PA_CC_AI) {
        ccLine = USBPD_CC2;
    }

    // 恢复为 CC_CMP_66
    USBPD->PORT_CC1 &= ~(CC_CMP_Mask | PA_CC_AI);
    USBPD->PORT_CC1 |= CC_CMP_66;
    USBPD->PORT_CC2 &= ~(CC_CMP_Mask | PA_CC_AI);
    USBPD->PORT_CC2 |= CC_CMP_66;

    return ccLine;
}

static void usbpd_sink_rx_mode(void) {
    // 清除全部状态
    USBPD->CONFIG |= PD_ALL_CLR;
    USBPD->CONFIG &= ~PD_ALL_CLR;

    // 设置为接收模式
    USBPD->BMC_CLK_CNT = UPD_TMR_RX_48M;
    USBPD->DMA = (uint32_t)usbpd_rx_buffer;

    // 开始接收
    USBPD->CONTROL &= ~PD_TX_EN;
    USBPD->CONTROL |= BMC_START;
}

static void usbpd_sink_state_reset(void) {
    NVIC_DisableIRQ(USBPD_IRQn);

    // 重置就绪状态
    pd_control_g.is_ready = false;

    // 重置 PD 版本
    pd_control_g.pd_version = DEF_PD_REVISION_30;

    // 重置状态机
    pd_control_g.pd_state = PD_STATE_CHECK_CONNECT;
    pd_control_g.pd_last_state = PD_STATE_CHECK_CONNECT;

    // 重置 PDO
    pd_control_g.pdo_pos = 1;
    pd_control_g.pdo_voltage_mv = 0;
    pd_control_g.available_pdos.pdo_count = 0;
    pd_control_g.spr_source_cap_buffer_pdo_count = 0;
    pd_control_g.epr_source_cap_buffer_pdo_count = 0;
    pd_control_g.epr_source_cap_buffer_size = 0;
    pd_control_g.epr_source_cap_buffer_chunk_number = 0;

    // 重置 CC 计数
    pd_control_g.cc_none_times = 0;
    pd_control_g.cc1_connect_times = 0;
    pd_control_g.cc2_connect_times = 0;

    // 重置 Message ID
    pd_control_g.sink_message_id = 0;
    pd_control_g.cable_message_id = 0;

    // 重置 EPR 相关变量
    pd_control_g.is_epr_ready = false;
    pd_control_g.source_epr_capable = false;  // 默认 source 不支持 EPR，后续根据判断
    pd_control_g.cable_epr_capable = true;    // 默认 cable 支持 EPR

    // 重置定时器
    pd_control_g.epr_keepalive_timer = 0;
    pd_control_g.pps_periodic_timer = 0;
}

static void usbpd_sink_phy_send_data(uint8_t *buffer, uint8_t length, uint8_t sop) {
    delay_us(90);  // 确保 GoodCRC 已发送

    USBPD->BMC_CLK_CNT = UPD_TMR_TX_48M;
    USBPD->TX_SEL = sop;
    USBPD->DMA = (uint32_t)buffer;
    USBPD->BMC_TX_SZ = length;

    USBPD->STATUS |= IF_TX_END;
    USBPD->CONTROL |= PD_TX_EN;
    USBPD->CONTROL |= BMC_START;

    while ((USBPD->STATUS & IF_TX_END) == 0);
    USBPD->STATUS |= IF_TX_END;

    usbpd_sink_rx_mode();
}

static void usbpd_sink_send_goodcrc(uint8_t message_id, bool is_cable) {
    USBPD_MessageHeader_t header = {0};
    header.MessageHeader.MessageType = USBPD_CONTROL_MSG_GOODCRC;
    header.MessageHeader.PortDataRole = 0;
    header.MessageHeader.SpecificationRevision = pd_control_g.pd_version;
    header.MessageHeader.PortPowerRole_CablePlug = is_cable;  // Cable Plug
    header.MessageHeader.MessageID = message_id;              // GoodCRC 回复相同的 MessageID
    header.MessageHeader.NumberOfDataObjects = 0;
    header.MessageHeader.Extended = 0;

    *(uint16_t *)&usbpd_tx_buffer[0] = header.d16;
    usbpd_sink_phy_send_data(usbpd_tx_buffer, 2, is_cable ? UPD_SOP1 : UPD_SOP0);

    // 在发送 SOP0 类型 GoodCRC 后，重置定时器
    if (!is_cable) {
        pd_control_g.epr_keepalive_timer = 0;
        pd_control_g.pps_periodic_timer = 0;
    }
}

void usbpd_sink_hard_reset(void) {
    usbpd_sink_phy_send_data(usbpd_tx_buffer, 0, UPD_HARD_RESET);
    usbpd_sink_state_reset();
}

bool usbpd_sink_get_ready(void) {
    return pd_control_g.is_ready;
}

bool usbpd_sink_get_epr_ready(void) {
    return pd_control_g.is_epr_ready;
}

/******************************************************************************
 * Initialization Function
 *****************************************************************************/

static void timer_init(void) {
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3, ENABLE);

    TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStructure = {0};
    TIM_TimeBaseInitStructure.TIM_Period = 1000 - 1;  // 1ms
    TIM_TimeBaseInitStructure.TIM_Prescaler = 48 - 1;
    TIM_TimeBaseInitStructure.TIM_ClockDivision = TIM_CKD_DIV1;
    TIM_TimeBaseInitStructure.TIM_CounterMode = TIM_CounterMode_Up;
    TIM_TimeBaseInitStructure.TIM_RepetitionCounter = 0x00;
    TIM_TimeBaseInit(TIM3, &TIM_TimeBaseInitStructure);

    TIM_ClearITPendingBit(TIM3, TIM_IT_Update);
    TIM_ITConfig(TIM3, TIM_IT_Update, ENABLE);

    NVIC_SetPriority(TIM3_IRQn, 0x10);
    NVIC_EnableIRQ(TIM3_IRQn);

    TIM_Cmd(TIM3, ENABLE);
}

void usbpd_sink_init(void) {
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE);
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE);
    RCC_AHBPeriphClockCmd(RCC_AHBPeriph_USBPD, ENABLE);

    GPIO_InitTypeDef GPIO_InitStructure = {0};
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_14 | GPIO_Pin_15;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
    GPIO_Init(GPIOC, &GPIO_InitStructure);

    AFIO->CTLR |= USBPD_IN_HVT | USBPD_PHY_V33;

    // 设置 CC 以正常 VDD 电压驱动输出
    USBPD->PORT_CC1 &= ~CC_LVE;
    USBPD->PORT_CC2 &= ~CC_LVE;

    // 清除全部状态
    USBPD->STATUS = BUF_ERR | IF_RX_BIT | IF_RX_BYTE | IF_RX_ACT | IF_RX_RESET | IF_TX_END;

