0wQ/CH32X035-PD-Tester/lib/usb_pd/usbpd_sink.c
    // 开启发送完成中断、接收完成中断、接收复位中断
    USBPD->CONFIG = IE_TX_END | IE_RX_ACT | IE_RX_RESET | PD_DMA_EN;

    // PD Sink
    USBPD->PORT_CC1 = CC_CMP_66 | CC_PD;
    USBPD->PORT_CC2 = CC_CMP_66 | CC_PD;

    usbpd_sink_rx_mode();

    NVIC_SetPriority(USBPD_IRQn, 0);
    NVIC_EnableIRQ(USBPD_IRQn);

    timer_init();
}

/******************************************************************************
 * SPR Mode Function
 * EPR Mode Function
 *****************************************************************************/

// TODO: 构建发送请求分散到多个函数
// NOT_SUPPORTED
// REJECT
// VDM_ACK_DISCOVER_IDENTITY
// VDM_ACK_DISCOVER_SVIDS
// SEND_EPR_ENTER
// SEND_EPR_SRC_CAP_REQ_CHUNK

static void usbpd_sink_epr_keep_alive(void) {
    // 检查是否已进入 EPR 模式
    if (!pd_control_g.is_epr_ready) return;

    USBPD_MessageHeader_t header = {0};
    header.MessageHeader.MessageType = ExtendedMessageType_ExtendedControl;
    header.MessageHeader.SpecificationRevision = USBPD_SPECIFICATION_REV3;
    header.MessageHeader.NumberOfDataObjects = 1;
    header.MessageHeader.Extended = 1;
    header.MessageHeader.MessageID = pd_control_g.sink_message_id;

    // Extended header
    USBPD_ExtendedMessageHeader_t ext_header = {0};
    ext_header.ExtendedMessageHeader.Chunked = 1;
    ext_header.ExtendedMessageHeader.ChunkNumber = 0;
    ext_header.ExtendedMessageHeader.RequestChunk = 0;
    ext_header.ExtendedMessageHeader.DataSize = 2;

    // Extended Control Message
    usbpd_tx_buffer[0] = header.d16 & 0xFF;
    usbpd_tx_buffer[1] = (header.d16 >> 8) & 0xFF;
    usbpd_tx_buffer[2] = ext_header.d16 & 0xFF;
    usbpd_tx_buffer[3] = (ext_header.d16 >> 8) & 0xFF;
    usbpd_tx_buffer[4] = 0x03;  // EPR_KeepAlive
    usbpd_tx_buffer[5] = 0x00;  // Reserved

    pd_printf("Sending EPR keep alive\n");
    usbpd_sink_phy_send_data(usbpd_tx_buffer, 6, UPD_SOP0);
    pd_control_g.pd_state = PD_STATE_WAIT_EPR_KEEP_ALIVE_ACK;
}

static bool usbpd_sink_request(uint8_t position) {
    // TODO: 此函数可能需要删除多余的电压范围验证

    // 查找对应位置的 PDO
    pd_pdo_t *pdo = NULL;
    for (uint8_t i = 0; i < pd_control_g.available_pdos.pdo_count; i++) {
        if (pd_control_g.available_pdos.pdo[i].position == position) {
            pdo = &pd_control_g.available_pdos.pdo[i];
            break;
        }
    }

    if (pdo == NULL) {
        pd_printf("usbpd_sink_request: PDO position %d not found\n", position);
        return false;
    }

    // 构建 RDO
    USBPD_RDO_t rdo = {0};

    switch (pdo->pdo_type) {
        case PDO_TYPE_FIXED_SUPPLY: {
            // 检查硬件限制电压
            if (pdo->fixed.voltage > CONFIG_HW_MAX_VOLTAGE) {
                pd_printf("usbpd_sink_request: voltage %dmV > %dmV\n", pdo->fixed.voltage, CONFIG_HW_MAX_VOLTAGE);
                return false;
            }
            usbpd_rdo_build_fixed(&rdo, position, pdo->fixed.voltage, pdo->fixed.current);
            break;
        }

        case PDO_TYPE_APDO: {
            if (pdo->apdo_subtype == APDO_TYPE_SPR_PPS) {
                // 使用指定电压或最小电压
                uint16_t voltage = (pd_control_g.pdo_voltage_mv > 0) ? pd_control_g.pdo_voltage_mv : pdo->pps.min_voltage;
                // 检查档位电压范围
                if (voltage < pdo->pps.min_voltage || voltage > pdo->pps.max_voltage) {
                    pd_printf("usbpd_sink_request: voltage %dmV not in [%dmV, %dmV]\n", voltage, pdo->pps.min_voltage, pdo->pps.max_voltage);
                    return false;
                }
                // 检查硬件限制电压
                if (voltage > CONFIG_HW_MAX_VOLTAGE) {
                    pd_printf("usbpd_sink_request: voltage %dmV > %dmV\n", voltage, CONFIG_HW_MAX_VOLTAGE);
                    return false;
                }
                usbpd_rdo_build_pps(&rdo, position, voltage, pdo->pps.current);

            } else if (pdo->apdo_subtype == APDO_TYPE_EPR_AVS) {
                // 使用指定电压或最小电压
                uint16_t voltage = (pd_control_g.pdo_voltage_mv > 0) ? pd_control_g.pdo_voltage_mv : pdo->epr_avs.min_voltage;
                // 检查档位电压范围
                if (voltage < pdo->epr_avs.min_voltage || voltage > pdo->epr_avs.max_voltage) {
                    pd_printf("usbpd_sink_request: voltage %dmV not in [%dmV, %dmV]\n", voltage, pdo->epr_avs.min_voltage, pdo->epr_avs.max_voltage);
                    return false;
                }
                // 检查硬件限制电压
                if (voltage > CONFIG_HW_MAX_VOLTAGE) {
                    pd_printf("usbpd_sink_request: voltage %dmV > %dmV\n", voltage, CONFIG_HW_MAX_VOLTAGE);
                    return false;
                }
                // 根据 PDP 和电压计算电流
                uint16_t current = ((uint32_t)pdo->epr_avs.pdp * 1000000U) / voltage;
                current = current > 5000 ? 5000 : current;
                usbpd_rdo_build_avs(&rdo, position, voltage, current);

            } else if (pdo->apdo_subtype == APDO_TYPE_SPR_AVS) {
                // 使用指定电压或最小电压
                uint16_t voltage = (pd_control_g.pdo_voltage_mv > 0) ? pd_control_g.pdo_voltage_mv : pdo->spr_avs.min_voltage;
                // 检查档位电压范围
                if (voltage < pdo->spr_avs.min_voltage || voltage > pdo->spr_avs.max_voltage) {
                    pd_printf("usbpd_sink_request: voltage %dmV not in [%dmV, %dmV]\n", voltage, pdo->spr_avs.min_voltage, pdo->spr_avs.max_voltage);
                    return false;
                }
                // 检查硬件限制电压
                if (voltage > CONFIG_HW_MAX_VOLTAGE) {
                    pd_printf("usbpd_sink_request: voltage %dmV > %dmV\n", voltage, CONFIG_HW_MAX_VOLTAGE);
                    return false;
                }
                // 判断最大电流
                uint16_t current = voltage > 15000 ? pdo->spr_avs.max_current_15v_20v : pdo->spr_avs.max_current_9v_15v;
                usbpd_rdo_build_avs(&rdo, position, voltage, current);

            } else {
                pd_printf("usbpd_sink_request: Unsupported APDO subtype %d\n", pdo->apdo_subtype);
                return false;
            }
            break;
        }

        default: {
            pd_printf("usbpd_sink_request: Unsupported PDO type %d\n", pdo->pdo_type);
            return false;
        }
    }

    // 格式化请求
    uint8_t length;
    if (pd_control_g.is_epr_ready) {
        length = usbpd_rdo_format_epr_request(usbpd_tx_buffer, &rdo, pdo->raw, pd_control_g.sink_message_id);
        pd_printf("Sending EPR request: Pos=%d, RDO=0x%08x, PDO=0x%08x\n", position, rdo.d32, pdo->raw);
    } else {
        length = usbpd_rdo_format_spr_request(usbpd_tx_buffer, &rdo, pd_control_g.sink_message_id, pd_control_g.pd_version);
        pd_printf("Sending SPR request: Pos=%d, RDO=0x%08x\n", position, rdo.d32);
    }

    // 发送请求
    usbpd_sink_phy_send_data(usbpd_tx_buffer, length, UPD_SOP0);
    return true;
}

