0wQ/CH32X035-PD-Tester/lib/usb_pd/usbpd_sink.c
bool usbpd_sink_set_fpdo_position(uint8_t position) {
    // 查找对应位置的 PDO，验证是否为 Fixed Supply
    pd_pdo_t *pdo = NULL;
    for (uint8_t i = 0; i < pd_control_g.available_pdos.pdo_count; i++) {
        if (pd_control_g.available_pdos.pdo[i].position == position) {
            pdo = &pd_control_g.available_pdos.pdo[i];
            break;
        }
    }

    if (pdo == NULL) {
        pd_printf("usbpd_sink_set_fpdo_position(%d): position not found\n", position);
        return false;
    }

    if (pdo->pdo_type != PDO_TYPE_FIXED_SUPPLY) {
        pd_printf("usbpd_sink_set_fpdo_position(%d): not a Fixed Supply PDO\n", position);
        return false;
    }

    if (!pd_control_g.is_ready) {
        pd_printf("usbpd_sink_set_fpdo_position(%d): not ready\n", position);
        return false;
    }

    // 检查硬件限制电压
    if (pdo->fixed.voltage > CONFIG_HW_MAX_VOLTAGE) {
        pd_printf("usbpd_sink_set_fpdo_position(%d): voltage %dmV > %dmV\n", position, pdo->fixed.voltage, CONFIG_HW_MAX_VOLTAGE);
        return false;
    }

    // 等待状态机进入空闲状态，超时后返回
    uint32_t start_time = millis();
    while (pd_control_g.pd_state != PD_STATE_IDLE) {
        if (millis() - start_time > 1000) {
            pd_printf("usbpd_sink_set_fpdo_position(%d): wait for idle timeout\n", position);
            return false;
        }
    }

    // 设置 PDO Position 和电压为 0（表示使用 PDO 默认值）
    pd_control_g.pdo_pos = position;
    pd_control_g.pdo_voltage_mv = 0;

    // 判断 SPR/EPR，设置状态机进入对应的 SEND_REQUEST 状态
    pd_control_g.pd_state = pd_control_g.is_epr_ready ? PD_STATE_SEND_EPR_REQUEST : PD_STATE_SEND_SPR_REQUEST;

    pd_printf("usbpd_sink_set_fpdo_position(%d): success\n", position);
    return true;
}

bool usbpd_sink_set_apdo_position_with_voltage(uint8_t position, uint16_t voltage_mv) {
    // 查找对应位置的 PDO
    pd_pdo_t *pdo = NULL;
    for (uint8_t i = 0; i < pd_control_g.available_pdos.pdo_count; i++) {
        if (pd_control_g.available_pdos.pdo[i].position == position) {
            pdo = &pd_control_g.available_pdos.pdo[i];
            break;
        }
    }

    if (pdo == NULL) {
        pd_printf("usbpd_sink_set_apdo_position_with_voltage(%d, %d): position not found\n", position, voltage_mv);
        return false;
    }

    if (pdo->pdo_type != PDO_TYPE_APDO) {
        pd_printf("usbpd_sink_set_apdo_position_with_voltage(%d, %d): not an APDO\n", position, voltage_mv);
        return false;
    }

    // 检查硬件限制电压
    if (pdo->fixed.voltage > CONFIG_HW_MAX_VOLTAGE) {
        pd_printf("usbpd_sink_set_apdo_position_with_voltage(%d, %d): voltage %dmV > %dmV\n", position, voltage_mv, voltage_mv, CONFIG_HW_MAX_VOLTAGE);
        return false;
    }

    // 验证电压范围和步进
    uint16_t min_voltage = 0;
    uint16_t max_voltage = 0;
    uint16_t step_mv = 0;

    if (pdo->apdo_subtype == APDO_TYPE_SPR_PPS) {
        min_voltage = pdo->pps.min_voltage;
        max_voltage = pdo->pps.max_voltage;
        step_mv = 20;  // PPS 步进 20mV
    } else if (pdo->apdo_subtype == APDO_TYPE_EPR_AVS) {
        min_voltage = pdo->epr_avs.min_voltage;
        max_voltage = pdo->epr_avs.max_voltage;
        step_mv = 100;  // EPR AVS 步进 100mV
    } else if (pdo->apdo_subtype == APDO_TYPE_SPR_AVS) {
        min_voltage = pdo->spr_avs.min_voltage;
        max_voltage = pdo->spr_avs.max_voltage;
        step_mv = 100;  // SPR AVS 步进 100mV
    } else {
        pd_printf("usbpd_sink_set_apdo_position_with_voltage(%d, %d): unsupported APDO subtype\n", position, voltage_mv);
        return false;
    }

    // 检查电压范围
    if (voltage_mv < min_voltage || voltage_mv > max_voltage) {
        pd_printf("usbpd_sink_set_apdo_position_with_voltage(%d, %d): voltage out of range [%d-%d]\n", position, voltage_mv, min_voltage, max_voltage);
        return false;
    }

    // 检查步进对齐
    if ((voltage_mv % step_mv) != 0) {
        pd_printf("usbpd_sink_set_apdo_position_with_voltage(%d, %d): voltage not aligned to %dmV step\n", position, voltage_mv, step_mv);
        return false;
    }

    if (!pd_control_g.is_ready) {
        pd_printf("usbpd_sink_set_apdo_position_with_voltage(%d, %d): not ready\n", position, voltage_mv);
        return false;
    }

    // 等待状态机进入空闲状态，超时后返回
    uint32_t start_time = millis();
    while (pd_control_g.pd_state != PD_STATE_IDLE) {
        if (millis() - start_time > 1000) {
            pd_printf("usbpd_sink_set_apdo_position_with_voltage(%d, %d): wait for idle timeout\n", position, voltage_mv);
            return false;
        }
    }

    // 设置 PDO Position 和电压
    pd_control_g.pdo_pos = position;
    pd_control_g.pdo_voltage_mv = voltage_mv;

    // 判断 SPR/EPR，设置状态机进入对应的 SEND_REQUEST 状态
    pd_control_g.pd_state = pd_control_g.is_epr_ready ? PD_STATE_SEND_EPR_REQUEST : PD_STATE_SEND_SPR_REQUEST;

    pd_printf("usbpd_sink_set_apdo_position_with_voltage(%d, %d): success\n", position, voltage_mv);
    return true;
}

bool usbpd_sink_set_position(uint8_t position) {
    // 查找对应位置的 PDO，验证是否为 Fixed Supply
    pd_pdo_t *pdo = NULL;
    for (uint8_t i = 0; i < pd_control_g.available_pdos.pdo_count; i++) {
        if (pd_control_g.available_pdos.pdo[i].position == position) {
            pdo = &pd_control_g.available_pdos.pdo[i];
            break;
        }
    }

    if (pdo == NULL) {
        pd_printf("usbpd_sink_set_position(%d): position not found\n", position);
        return false;
    }

    // if (pdo->pdo_type == PDO_TYPE_FIXED_SUPPLY) {
    //     usbpd_sink_set_fpdo_position(position);
    // }
    // if (pdo->pdo_type == PDO_TYPE_APDO) {
    //     usbpd_sink_set_apdo_position_with_voltage(position, 0);
    // }

    return true;
}

/******************************************************************************
 * USB PD Protocol Parsing and State Machine Handler
 *****************************************************************************/

/**
 * @brief Source Power Data Objects 解析函数
 * @param pdos Source Power Data Objects 数据指针
 * @param pdo_count PDO 数量
 * @param is_epr 是否是 EPR Capabilities Message
 * @note 解析 pdos 将可用的 pdo 存储到 pd_control_g.available_pdos 中
 */
static void usbpd_sink_pdos_analyse(const uint32_t *pdos, const uint8_t pdo_count, const bool is_epr) {
    // EPR 能力消息中的功率数据对象应按以下顺序发送：
    // 1) 如 SPR 能力消息中所报告的 SPR (A)PDOs，EPR 能力消息的消息头中的数据对象数量字段应与 SPR 能力消息的消息头中的数据对象数量字段相同
    // 2) 如果 SPR 能力消息中包含的 PDOs 少于 7 个，则未使用的数据对象应填充为零
    // 3) 如第 6.4.1 Capabilities Message 中定义的 EPR (A)PDOs 应从数据对象位置 8 开始，并按以下顺序发送：
    //     a) 如果存在，提供 28V、36V 或 48V 的固定供电 PDO 应按电压顺序发送，从低到高
    //     b) 应发送一个 EPRAVS APDO

    if (pdo_count == 0) return;
    pd_printf(is_epr ? "EPR Source Capabilities:\n" : "SPR Source Capabilities:\n");

    // 重置 PDO 计数
    pd_control_g.available_pdos.pdo_count = 0;

    // 解析 PDO
    USBPD_SourcePDO_t pdo_parser = {0};
    for (uint8_t i = 0; i < pdo_count; i++) {
        pdo_parser.d32 = pdos[i];
        pd_pdo_t *pdo = &pd_control_g.available_pdos.pdo[pd_control_g.available_pdos.pdo_count];

        // 保存原始 PDO 数据
        pdo->raw = pdos[i];
        pdo->position = i + 1;  // PDO 位置从 1 开始

        // 如果是 EPR 类型，position 最小应从 8 开始
        if (pdo->position < 8) {
            // EPR Fixed
            if (pdo_parser.General.PDO_Type == PDO_TYPE_FIXED_SUPPLY && POWER_DECODE_50MV(pdo_parser.Fixed.VoltageIn50mVunits) > 20000) {
                pdo->position = 8;
            }
            // EPR AVS
            if (pdo_parser.General.PDO_Type == PDO_TYPE_APDO && pdo_parser.General.APDO_SubType == APDO_TYPE_EPR_AVS) {
                pdo->position = 8;
            }
        }

        pd_printf("  PDO[#%d][RAW:0x%08x]: ", i + 1, pdo_parser.d32);

