0wQ/CH32X035-PD-Tester/lib/usb_pd/usbpd_sink.c
        // 首先检查 PDO 是否为空
        if (pdo_parser.d32 == 0) {
            pd_printf("Empty\n");
            continue;
        }

        switch (pdo_parser.General.PDO_Type) {
            case PDO_TYPE_FIXED_SUPPLY: {
                uint16_t voltage = POWER_DECODE_50MV(pdo_parser.Fixed.VoltageIn50mVunits);
                uint16_t current = POWER_DECODE_10MA(pdo_parser.Fixed.MaxCurrentIn10mAunits);

                pd_control_g.available_pdos.pdo_count++;
                pd_control_g.source_epr_capable = pdo_parser.Fixed.EPRCapable ? 1 : pd_control_g.source_epr_capable;  // EPRCapable=1 可能只在 5V PDO 中出现，后续可能为 0
                pdo->pdo_type = PDO_TYPE_FIXED_SUPPLY;
                pdo->fixed.voltage = voltage;
                pdo->fixed.current = current;
                pdo->fixed.epr_capable = pdo_parser.Fixed.EPRCapable;

                pd_printf("%s Fixed: %dmV, %dmA%s\n", voltage <= 20000 ? "SPR" : "EPR", voltage, current, pdo_parser.Fixed.EPRCapable ? " (EPR Capable)" : "");
                break;
            }
            case PDO_TYPE_BATTERY: {
                uint16_t max_voltage = POWER_DECODE_50MV(pdo_parser.Battery.MaxVoltageIn50mVunits);
                uint16_t min_voltage = POWER_DECODE_50MV(pdo_parser.Battery.MinVoltageIn50mVunits);
                uint16_t max_power = POWER_DECODE_250MW(pdo_parser.Battery.MaxAllowablePowerIn250mWunits);
                pd_printf("Battery: %d-%dmV, %dmW\n", min_voltage, max_voltage, max_power);
                break;
            }
            case PDO_TYPE_VARIABLE_SUPPLY: {
                uint16_t max_voltage = POWER_DECODE_50MV(pdo_parser.Variable.MaxVoltageIn50mVunits);
                uint16_t min_voltage = POWER_DECODE_50MV(pdo_parser.Variable.MinVoltageIn50mVunits);
                uint16_t current = POWER_DECODE_10MA(pdo_parser.Variable.MaxCurrentIn10mAunits);
                pd_printf("Variable Supply: %d-%dmV, %dmA\n", min_voltage, max_voltage, current);
                break;
            }
            case PDO_TYPE_APDO: {
                switch (pdo_parser.General.APDO_SubType) {
                    case APDO_TYPE_SPR_PPS: {
                        uint16_t min_voltage = POWER_DECODE_100MV(pdo_parser.SPR_PPS.MinVoltageIn100mVunits);
                        uint16_t max_voltage = POWER_DECODE_100MV(pdo_parser.SPR_PPS.MaxVoltageIn100mVunits);
                        uint16_t current = POWER_DECODE_50MA(pdo_parser.SPR_PPS.MaxCurrentIn50mAunits);

                        pd_control_g.available_pdos.pdo_count++;
                        pdo->pdo_type = PDO_TYPE_APDO;
                        pdo->apdo_subtype = APDO_TYPE_SPR_PPS;
                        pdo->pps.min_voltage = min_voltage;
                        pdo->pps.max_voltage = max_voltage;
                        pdo->pps.current = current;

                        pd_printf("SPR PPS: %d-%dmV, %dmA\n", min_voltage, max_voltage, current);
                        break;
                    }
                    case APDO_TYPE_EPR_AVS: {
                        uint16_t pdp = pdo_parser.EPR_AVS.PDPIn1Wunits;
                        uint16_t min_voltage = POWER_DECODE_100MV(pdo_parser.EPR_AVS.MinVoltageIn100mVunits);
                        uint16_t max_voltage = POWER_DECODE_100MV(pdo_parser.EPR_AVS.MaxVoltageIn100mVunits);

                        pd_control_g.available_pdos.pdo_count++;
                        pdo->pdo_type = PDO_TYPE_APDO;
                        pdo->apdo_subtype = APDO_TYPE_EPR_AVS;
                        pdo->epr_avs.pdp = pdp;
                        pdo->epr_avs.min_voltage = min_voltage;
                        pdo->epr_avs.max_voltage = max_voltage;

                        pd_printf("EPR AVS: %d-%dmV, %dW\n", min_voltage, max_voltage, pdp);
                        break;
                    }
                    case APDO_TYPE_SPR_AVS: {
                        uint16_t max_current_9v_15v = POWER_DECODE_10MA(pdo_parser.SPR_AVS.MaxCurrentFor9V15VIn10mAunits);
                        uint16_t max_current_15v_20v = POWER_DECODE_10MA(pdo_parser.SPR_AVS.MaxCurrentFor15V20VIn10mAunits);

                        pd_control_g.available_pdos.pdo_count++;
                        pdo->pdo_type = PDO_TYPE_APDO;
                        pdo->apdo_subtype = APDO_TYPE_SPR_AVS;
                        pdo->spr_avs.max_current_9v_15v = max_current_9v_15v;
                        pdo->spr_avs.max_current_15v_20v = max_current_15v_20v;
                        pdo->spr_avs.min_voltage = max_current_9v_15v > 0 ? 9000 : 15000;
                        pdo->spr_avs.max_voltage = max_current_15v_20v > 0 ? 20000 : 15000;

                        pd_printf("SPR AVS: 9V-15V, %dmA | 15V-20V, %dmA\n", max_current_9v_15v, max_current_15v_20v);
                        break;
                    }
                    case APDO_TYPE_RESERVED: {
                        pd_printf("Reserved APDO type\n");
                        break;
                    }
                }
                break;
            }
        }
    }
}

/**
 * @brief PD 状态机处理函数
 * @note 需在 TIM3_IRQHandler 中调用
 */
static void usbpd_sink_state_process(void) {
    pd_state_t _pd_state = pd_control_g.pd_state;

    if (pd_control_g.pd_last_state != _pd_state) {
        pd_printf("PD State: %d -> %d\n", pd_control_g.pd_last_state, pd_control_g.pd_state);
    }

    switch (pd_control_g.pd_state) {
        case PD_STATE_DISCONNECTED: {
            usbpd_sink_state_reset();
            break;
        }
        case PD_STATE_CONNECT: {
            // 确保进入此状态后只执行一次
            if (pd_control_g.pd_last_state != pd_control_g.pd_state) {
                usbpd_sink_rx_mode();
                NVIC_EnableIRQ(USBPD_IRQn);
            }
            break;
        }
        case PD_STATE_RECEIVED_SPR_SOURCE_CAP: {
            usbpd_sink_pdos_analyse(pd_control_g.spr_source_cap_buffer, pd_control_g.spr_source_cap_buffer_pdo_count, false);
            pd_control_g.pd_state = PD_STATE_SEND_SPR_REQUEST;
            break;
        }
        case PD_STATE_SEND_SPR_REQUEST:
        case PD_STATE_SEND_EPR_REQUEST: {
            bool req_ok = usbpd_sink_request(pd_control_g.pdo_pos);
            pd_control_g.pd_state = req_ok ? PD_STATE_WAIT_ACCEPT : PD_STATE_IDLE;
            break;
        }
        case PD_STATE_RECEIVED_PS_RDY: {
            pd_control_g.is_ready = true;

#ifdef CONFIG_EPR_MODE_ENABLE
            // 如果未进入 EPR 模式，并且 source 和 cable 都支持 EPR, 则进入 EPR 模式
            if (!pd_control_g.is_epr_ready && pd_control_g.source_epr_capable && pd_control_g.cable_epr_capable) {
                pd_printf("Found EPR capable PDO, entering EPR mode\n");
                pd_control_g.pd_state = PD_STATE_SEND_EPR_ENTER;
                break;
            }
#endif

            pd_control_g.pd_state = PD_STATE_IDLE;
            // pd_control_g.pd_state = pd_control_g.is_epr_ready ? PD_STATE_SEND_EPR_REQUEST : PD_STATE_SEND_SPR_REQUEST;  // speedtest
            break;
        }
        case PD_STATE_SEND_EPR_ENTER: {
            pd_control_g.is_epr_ready = false;  // 标记此时还未进入 EPR 模式

            USBPD_MessageHeader_t header = {0};
            header.MessageHeader.MessageType = USBPD_DATA_MSG_EPR_MODE;
            header.MessageHeader.SpecificationRevision = USBPD_SPECIFICATION_REV3;
            header.MessageHeader.NumberOfDataObjects = 1u;
            header.MessageHeader.MessageID = pd_control_g.sink_message_id;

            uint32_t eprmdo = 0;
            eprmdo |= (1u << 24);  // Action(B31-24), Enter(0x01)
            eprmdo |= (0u << 16);  // Data(B23-16)

            *(uint16_t *)&usbpd_tx_buffer[0] = header.d16;
            *(uint32_t *)&usbpd_tx_buffer[2] = eprmdo;

