0wQ/CH32X035-PD-Tester/lib/usb_pd/usbpd_sink.c
            pd_printf("EPR mode: send Enter\n");
            usbpd_sink_phy_send_data(usbpd_tx_buffer, 6, UPD_SOP0);
            pd_control_g.pd_state = PD_STATE_WAIT_EPR_ENTER_RESPONSE;
            break;
        }
        case PD_STATE_SEND_EPR_SRC_CAP_REQ_CHUNK: {
            USBPD_MessageHeader_t header = {0};
            header.MessageHeader.MessageType = ExtendedMessageType_EPRSourceCapabilities;
            header.MessageHeader.SpecificationRevision = pd_control_g.pd_version;
            header.MessageHeader.MessageID = pd_control_g.sink_message_id;
            header.MessageHeader.NumberOfDataObjects = 1;
            header.MessageHeader.Extended = 1;

            USBPD_ExtendedMessageHeader_t ext_header = {0};
            ext_header.ExtendedMessageHeader.ChunkNumber = pd_control_g.epr_source_cap_buffer_chunk_number + 1;
            ext_header.ExtendedMessageHeader.RequestChunk = 1;
            ext_header.ExtendedMessageHeader.Chunked = 1;
            ext_header.ExtendedMessageHeader.DataSize = 0;

            *(uint16_t *)&usbpd_tx_buffer[0] = header.d16;
            *(uint16_t *)&usbpd_tx_buffer[2] = ext_header.d16;
            usbpd_tx_buffer[4] = 0;
            usbpd_tx_buffer[5] = 0;

            usbpd_sink_phy_send_data(usbpd_tx_buffer, 6, UPD_SOP0);
            pd_control_g.pd_state = PD_STATE_WAIT_EPR_MODE_SOURCE_CAP;
            break;
        }
        case PD_STATE_RECEIVED_EPR_SOURCE_CAP: {
            usbpd_sink_pdos_analyse(pd_control_g.epr_source_cap_buffer, pd_control_g.epr_source_cap_buffer_pdo_count, true);
            pd_control_g.pd_state = PD_STATE_SEND_EPR_REQUEST;
            break;
        }
        case PD_STATE_SEND_NOT_SUPPORTED: {
            USBPD_MessageHeader_t header = {0};
            header.MessageHeader.MessageID = pd_control_g.sink_message_id;
            header.MessageHeader.MessageType = USBPD_CONTROL_MSG_NOT_SUPPORTED;
            header.MessageHeader.SpecificationRevision = pd_control_g.pd_version;

            *(uint16_t *)&usbpd_tx_buffer[0] = header.d16;

            usbpd_sink_phy_send_data(usbpd_tx_buffer, 2, UPD_SOP0);
            pd_control_g.pd_state = PD_STATE_IDLE;
            break;
        }
        case PD_STATE_SEND_VDM_ACK_DISCOVER_IDENTITY: {
            USBPD_MessageHeader_t header = {0};
            header.MessageHeader.MessageID = pd_control_g.sink_message_id;
            header.MessageHeader.MessageType = USBPD_DATA_MSG_VENDOR_DEFINED;
            header.MessageHeader.SpecificationRevision = pd_control_g.pd_version;
            header.MessageHeader.NumberOfDataObjects = 4;

            *(uint16_t *)&usbpd_tx_buffer[0] = header.d16;
            *(uint32_t *)&usbpd_tx_buffer[2] = 0xFF00A041;
            *(uint32_t *)&usbpd_tx_buffer[6] = 0x18002E99;
            *(uint32_t *)&usbpd_tx_buffer[10] = 0x00000000;
            *(uint32_t *)&usbpd_tx_buffer[14] = 0x00000000;

            usbpd_sink_phy_send_data(usbpd_tx_buffer, (2 + 4 * 4), UPD_SOP0);
            pd_control_g.pd_state = PD_STATE_IDLE;
            break;
        }
        case PD_STATE_SEND_VDM_ACK_DISCOVER_SVIDS: {
            USBPD_MessageHeader_t header = {0};
            header.MessageHeader.MessageID = pd_control_g.sink_message_id;
            header.MessageHeader.MessageType = USBPD_DATA_MSG_VENDOR_DEFINED;
            header.MessageHeader.SpecificationRevision = pd_control_g.pd_version;
            header.MessageHeader.NumberOfDataObjects = 4;

            *(uint16_t *)&usbpd_tx_buffer[0] = header.d16;
            *(uint32_t *)&usbpd_tx_buffer[2] = 0xFF00A042;
            *(uint32_t *)&usbpd_tx_buffer[6] = 0x00000000;
            *(uint32_t *)&usbpd_tx_buffer[10] = 0x04C0C737;
            *(uint32_t *)&usbpd_tx_buffer[14] = 0x00000000;
            *(uint32_t *)&usbpd_tx_buffer[18] = 0x00000000;

            usbpd_sink_phy_send_data(usbpd_tx_buffer, (2 + 5 * 4), UPD_SOP0);
            pd_control_g.pd_state = PD_STATE_IDLE;
            break;
        }
        default: {
            break;
        }
    }

    pd_control_g.pd_last_state = _pd_state;
}

/**
 * @brief 解析 PD SOP0 数据包，并回复 GoodCRC
 * @note 需在 USBPD_IRQHandler 中调用
 */
static void usbpd_sink_protocol_analysis_sop0(const uint8_t *rx_buffer, const uint8_t rx_length) {
    // Header
    USBPD_MessageHeader_t header = {0};
    header.d16 = *(uint16_t *)rx_buffer;

    // 如果当前收到消息非 GoodCRC，则需先回复 GoodCRC
    bool is_goodcrc_msg = (header.MessageHeader.Extended == 0) &&
                          (header.MessageHeader.NumberOfDataObjects == 0) &&
                          (header.MessageHeader.MessageType == USBPD_CONTROL_MSG_GOODCRC);
    if (!is_goodcrc_msg) {
        usbpd_sink_send_goodcrc(header.MessageHeader.MessageID, false);
    }

    // Non-Extended message
    if (header.MessageHeader.Extended == 0) {

        // Control Message (A Message is defined as a Control Message when the Number of Data Objects field in the Message Header is set to zero)
        if (header.MessageHeader.NumberOfDataObjects == 0) {
            switch (header.MessageHeader.MessageType) {
                case USBPD_CONTROL_MSG_GOODCRC: {
                    // 消息 ID 自增
                    pd_control_g.sink_message_id = (pd_control_g.sink_message_id + 1) & 0x07;
                    // 重置定时器
                    pd_control_g.epr_keepalive_timer = 0;
                    pd_control_g.pps_periodic_timer = 0;
                    break;
                }
                case USBPD_CONTROL_MSG_ACCEPT: {
                    pd_control_g.pd_state = PD_STATE_WAIT_PS_RDY;
                    break;
                }
                case USBPD_CONTROL_MSG_PS_RDY: {
                    pd_control_g.pd_state = PD_STATE_RECEIVED_PS_RDY;
                    break;
                }
                case USBPD_CONTROL_MSG_SOFT_RESET: {
                    usbpd_sink_state_reset();
                    break;
                }
                case USBPD_CONTROL_MSG_NOT_SUPPORTED: {
                    pd_control_g.pd_state = PD_STATE_IDLE;
                    // 在发送 EPR MODE Enter 后，如果收到 NOT_SUPPORTED 回复，则认为不支持 EPR
                    if (pd_control_g.pd_state == PD_STATE_WAIT_EPR_ENTER_RESPONSE) {
                        pd_control_g.cable_epr_capable = 0;
                        pd_control_g.source_epr_capable = 0;
                        pd_control_g.pd_state = PD_STATE_IDLE;
                    }
                    break;
                }
                case USBPD_CONTROL_MSG_GET_SNK_CAP:           // 待实现
                case USBPD_CONTROL_MSG_GET_SNK_CAP_EXTENDED:  // 待实现
                case USBPD_CONTROL_MSG_VCONN_SWAP:            // 待实现
                default: {
                    // pd_printf("USBPD_ControlMessageType_t unhandled message type: %d\n", messageHeader->MessageHeader.MessageType);
                    pd_control_g.pd_state = PD_STATE_SEND_NOT_SUPPORTED;
                    break;
                }
            }
        }

        // Data Message
        if (header.MessageHeader.NumberOfDataObjects > 0) {
            switch (header.MessageHeader.MessageType) {
                case USBPD_DATA_MSG_SRC_CAP: {
                    // 先保存原始数据
                    memcpy(pd_control_g.spr_source_cap_buffer, &rx_buffer[2], header.MessageHeader.NumberOfDataObjects * 4);
                    // 更新 SPR PDO 数量
                    pd_control_g.spr_source_cap_buffer_pdo_count = header.MessageHeader.NumberOfDataObjects;
                    // 在状态机解析 SPR PDO
                    pd_control_g.pd_state = PD_STATE_RECEIVED_SPR_SOURCE_CAP;
                    // 更新 pd version
                    pd_control_g.pd_version = header.MessageHeader.SpecificationRevision;
                    break;
                }
                case USBPD_DATA_MSG_EPR_MODE: {
                    uint32_t eprmdo = *(uint32_t *)&rx_buffer[2];
                    uint8_t action = (eprmdo >> 24) & 0xF;
                    uint8_t data = (eprmdo >> 16) & 0xFF;

                    switch (action) {
                        case 2: {  // Enter Acknowledged
                            pd_control_g.is_epr_ready = false;
                            // pd_printf("EPR mode: Enter Acknowledged\n");
                            break;
                        }
                        case 3: {  // Enter Succeeded
                            pd_control_g.is_epr_ready = true;
                            pd_control_g.pd_state = PD_STATE_WAIT_EPR_MODE_SOURCE_CAP;
                            // pd_printf("EPR mode: Enter Succeeded\n");
                            break;
                        }
                        case 4: {  // Enter Failed
                            pd_control_g.is_epr_ready = false;
                            pd_control_g.cable_epr_capable = 0;  // 认为 Cable 不支持 EPR, TODO: 可能要判断具体失败原因
                            pd_control_g.pd_state = PD_STATE_SEND_SPR_REQUEST;
                            pd_printf("EPR mode: Enter Failed, reason=0x%x\n", data);
                            break;
                        }
                        case 5: {  // Exit
                            pd_control_g.is_epr_ready = false;
                            pd_control_g.cable_epr_capable = 0;  // TODO: 还需要禁止后续收到 PSRDY 又重新进入 EPR
                            pd_control_g.pd_state = PD_STATE_SEND_SPR_REQUEST;
                            pd_printf("EPR mode: Exit\n");
                            break;
                        }
                        default: {
                            pd_printf("EPR mode: Unknown action=0x%x, data=0x%x\n", action, data);
                            break;
                        }
                    }
                    break;
                }
                case USBPD_DATA_MSG_VENDOR_DEFINED: {
                    USBPD_StructuredVDMHeader_t vdm_header = {0};
                    vdm_header.d32 = *(uint32_t *)&rx_buffer[2];

                    pd_printf("SOP0 VDM:\n");
                    pd_printf("  Header: 0x%08x\n", vdm_header.d32);
                    pd_printf("  SVID: 0x%04x\n", vdm_header.StructuredVDMHeader.SVID);
                    pd_printf("  Type: %d\n", vdm_header.StructuredVDMHeader.VDMType);
                    pd_printf("  Version: %d %d\n", vdm_header.StructuredVDMHeader.StructuredVDMVersionMajor, vdm_header.StructuredVDMHeader.StructuredVDMVersionMinor);
                    pd_printf("  Object Position: %d\n", vdm_header.StructuredVDMHeader.ObjectPosition);
                    pd_printf("  Command Type: %d\n", vdm_header.StructuredVDMHeader.CommandType);
                    pd_printf("  Command: %d\n", vdm_header.StructuredVDMHeader.Command);

                    if (vdm_header.StructuredVDMHeader.VDMType == 1) {             // 1 = Structured VDM
                        if (vdm_header.StructuredVDMHeader.CommandType == 0b00) {  // 00b = REQ
                            switch (vdm_header.StructuredVDMHeader.Command) {
                                case 1:  //  Discover Identity
                                    pd_control_g.pd_state = PD_STATE_SEND_VDM_ACK_DISCOVER_IDENTITY;
                                    break;
                                case 2:  // Discover SVIDs
                                    pd_control_g.pd_state = PD_STATE_SEND_VDM_ACK_DISCOVER_SVIDS;
                                    break;
                                default:  // 其他命令类型回复不支持
                                    pd_control_g.pd_state = PD_STATE_SEND_NOT_SUPPORTED;
                                    break;
                            }
                        }
                    }
                    break;
                }
                default: {
                    // pd_printf("USBPD_DataMessageType_t unhandled message type: %d\n", messageHeader->MessageHeader.MessageType);
                    break;
                }
            }
        }
    }

