0wQ/CH32X035-PD-Tester/lib/usb_pd/usbpd_sink.c
    // Extended message
    if (header.MessageHeader.Extended == 1u) {
        USBPD_ExtendedMessageHeader_t ext_header = {0};
        ext_header.d16 = *(uint16_t *)&rx_buffer[2];

        switch (header.MessageHeader.MessageType) {
            case ExtendedMessageType_EPRSourceCapabilities: {  // 收到 EPR Source Cap
                if (ext_header.ExtendedMessageHeader.Chunked) {
                    // 当前分块号
                    uint8_t current_chunk_number = ext_header.ExtendedMessageHeader.ChunkNumber;
                    // 当前分块大小
                    uint8_t chunk_size = rx_length - (2 /*Header*/ + 2 /*ExtHeader*/ + 4 /*CRC32*/);

                    // 收到分块号 0 时重置状态
                    if (current_chunk_number == 0) {
                        pd_control_g.epr_source_cap_buffer_size = 0;
                        pd_control_g.epr_source_cap_buffer_pdo_count = 0;
                        pd_control_g.epr_source_cap_buffer_chunk_number = 0;
                    }

                    // 保存
                    memcpy((uint8_t *)pd_control_g.epr_source_cap_buffer + pd_control_g.epr_source_cap_buffer_size, &rx_buffer[(2 /*Header*/ + 2 /*ExtHeader*/)], chunk_size);
                    // 更新 buffer size
                    pd_control_g.epr_source_cap_buffer_size += chunk_size;

                    if (chunk_size < 26) {
                        // 全部接收完成，在状态机中解析 EPR_SOURCE_CAP
                        pd_control_g.pd_state = PD_STATE_RECEIVED_EPR_SOURCE_CAP;
                        // 重置当前分块号
                        pd_control_g.epr_source_cap_buffer_chunk_number = 0;
                        // 更新 pdo count
                        pd_control_g.epr_source_cap_buffer_pdo_count = pd_control_g.epr_source_cap_buffer_size / 4;
                    } else {
                        // 请求下个分块
                        pd_control_g.pd_state = PD_STATE_SEND_EPR_SRC_CAP_REQ_CHUNK;
                        // 更新 chunk number
                        pd_control_g.epr_source_cap_buffer_chunk_number = current_chunk_number;
                    }
                }
                break;
            }
            case ExtendedMessageType_ExtendedControl: {
                // EPR_KeepAlive_Ack
                if (rx_buffer[4] == 0x04) {
                    pd_printf("EPR mode: Keep Alive Ack received\n");
                    pd_control_g.pd_state = PD_STATE_IDLE;
                }
                break;
            }
            default: {
                // pd_printf("Unhandled extended message type: %d\n", messageHeader->MessageHeader.MessageType);
                break;
            }
        }
    }
}

/**
 * @brief 解析 PD SOP1 数据包，并回复 GoodCRC
 * @note 需在 USBPD_IRQHandler 中调用
 */
static void usbpd_sink_protocol_analysis_sop1(const uint8_t *rx_buffer, const uint8_t rx_length) {
#ifdef CONFIG_EMARKER_ENABLE
    // Header
    USBPD_MessageHeader_t header = {0};
    header.d16 = *(uint16_t *)rx_buffer;

    // 如果当前收到消息非 GoodCRC，则需先回复 GoodCRC
    bool is_goodcrc_msg = (header.MessageHeader.Extended == 0) &&
                          (header.MessageHeader.NumberOfDataObjects == 0) &&
                          (header.MessageHeader.MessageType == USBPD_CONTROL_MSG_GOODCRC);
    if (!is_goodcrc_msg) {
        usbpd_sink_send_goodcrc(header.MessageHeader.MessageID, false);
    }

    // Non-Extended message
    if (header.MessageHeader.Extended == 0) {

        // Control Message (A Message is defined as a Control Message when the Number of Data Objects field in the Message Header is set to zero)
        if (header.MessageHeader.NumberOfDataObjects == 0) {
            switch (header.MessageHeader.MessageType) {
                case USBPD_CONTROL_MSG_GOODCRC: {
                    // 消息 ID 自增
                    pd_control_g.cable_message_id = (pd_control_g.cable_message_id + 1) & 0x07;
                    break;
                }
                default: {
                    break;
                }
            }
        }

        // Data Message
        if (header.MessageHeader.NumberOfDataObjects > 0) {
            // MessageType
            switch (header.MessageHeader.MessageType) {
                case USBPD_DATA_MSG_VENDOR_DEFINED: {
                    USBPD_StructuredVDMHeader_t vdm_header = {0};
                    vdm_header.d32 = *(uint32_t *)&rx_buffer[2];

                    // 需要抢先在 E-Marker 前回复，开日志的话，会导致比 E-Marker 回复慢
                    // pd_printf("SOP1 VDM:\n");
                    // pd_printf("  Header: 0x%08x\n", vdm_header.d32);
                    // pd_printf("  SVID: 0x%04x\n", vdm_header.StructuredVDMHeader.SVID);
                    // pd_printf("  Type: %d\n", vdm_header.StructuredVDMHeader.VDMType);
                    // pd_printf("  Version: %d %d\n", vdm_header.StructuredVDMHeader.StructuredVDMVersionMajor, vdm_header.StructuredVDMHeader.StructuredVDMVersionMinor);
                    // pd_printf("  Object Position: %d\n", vdm_header.StructuredVDMHeader.ObjectPosition);
                    // pd_printf("  Command Type: %d\n", vdm_header.StructuredVDMHeader.CommandType);
                    // pd_printf("  Command: %d\n", vdm_header.StructuredVDMHeader.Command);

                    if ((vdm_header.StructuredVDMHeader.VDMType == 1 /* Structured_VDM */) && (vdm_header.StructuredVDMHeader.CommandType == 0b00 /* REQ */)) {
                        // VDM Command
                        switch (vdm_header.StructuredVDMHeader.Command) {
                            case 1: {  //  Discover Identity
                                USBPD_MessageHeader_t _header;
                                _header.MessageHeader.MessageType = USBPD_DATA_MSG_VENDOR_DEFINED;
                                _header.MessageHeader.PortDataRole = 0;
                                _header.MessageHeader.SpecificationRevision = USBPD_SPECIFICATION_REV3;
                                _header.MessageHeader.PortPowerRole_CablePlug = 1;
                                _header.MessageHeader.MessageID = pd_control_g.cable_message_id;
                                _header.MessageHeader.NumberOfDataObjects = 5;
                                _header.MessageHeader.Extended = 0;

                                *(uint16_t *)&usbpd_tx_buffer[0] = _header.d16;

