0wQ/CH32X035-PD-Tester/lib/usb_pd/usbpd_sink.c
                                // 酷态科磁吸短线 E-Marker
                                // *(uint32_t *)&usbpd_tx_buffer[2] = 0xFF00A041;
                                // *(uint32_t *)&usbpd_tx_buffer[6] = 0x18002B01;
                                // *(uint32_t *)&usbpd_tx_buffer[10] = 0x00000000;
                                // *(uint32_t *)&usbpd_tx_buffer[14] = 0x40916D14;
                                // *(uint32_t *)&usbpd_tx_buffer[18] = 0x000A0640;

                                // 联想 C135 E-Marker
                                *(uint32_t *)&usbpd_tx_buffer[2] = 0xFF00A041;   // VDM Header
                                *(uint32_t *)&usbpd_tx_buffer[6] = 0x180017EF;   // ID Header VDO
                                *(uint32_t *)&usbpd_tx_buffer[10] = 0x00000000;  // Cert Stat VDO
                                *(uint32_t *)&usbpd_tx_buffer[14] = 0xA4AA0000;  // Product VDO
                                // *(uint32_t *)&usbpd_tx_buffer[18] = 0x110A2643;  // Product Type VDO(s)

                                USBPD_PassiveCableVDO_t vdo = {0};
                                vdo.PassiveCableVDO.USBHighestSpeed = 0b100;      // 000b = [USB 2.0] only, no SuperSpeed support
                                                                                  // 001b = [USB 3.2] Gen1
                                                                                  // 010b = [USB 3.2]/[USB4] Gen2
                                                                                  // 011b = [USB4] Gen3
                                                                                  // 100b = [USB4] Gen4
                                vdo.PassiveCableVDO.VBUSCurrentHandling = 0b10;   // 01b = 3A
                                                                                  // 10b = 5A
                                vdo.PassiveCableVDO.MaxVBUSVoltage = 0b11;        // 00b – 20V
                                                                                  // 01b – 30V (Deprecated)
                                                                                  // 10b – 40V (Deprecated)
                                                                                  // 11b – 50V
                                vdo.PassiveCableVDO.CableTerminationType = 0b00;  // 00b = VCONN not required. Cable Plugs that only support Discover Identity Commands Shall set these bits to 00b.
                                                                                  // 01b = VCONN required
                                vdo.PassiveCableVDO.CableLatency = 0b1000;        // 0001b – <10ns (~1m)
                                                                                  // 0010b – 10ns to 20ns (~2m)
                                                                                  // 0011b – 20ns to 30ns (~3m)
                                                                                  // 0100b – 30ns to 40ns (~4m)
                                                                                  // 0101b – 40ns to 50ns (~5m)
                                                                                  // 0110b – 50ns to 60ns (~6m)
                                                                                  // 0111b – 60ns to 70ns (~7m)
                                                                                  // 1000b – > 70ns (>~7m)
                                vdo.PassiveCableVDO.EPRCapable = 0b1;             // 0b – Cable is not EPR Capable
                                                                                  // 1b = Cable is EPR Capable
                                vdo.PassiveCableVDO.USBTypeCPlug = 0b10;          // 10b = USB Type-C
                                                                                  // 11b = Captive
                                vdo.PassiveCableVDO.VDOVersion = 0b000;           // Version 1.0 = 000b
                                vdo.PassiveCableVDO.FirmwareVersion = 1;
                                vdo.PassiveCableVDO.HWVersion = 1;

                                *(uint32_t *)&usbpd_tx_buffer[18] = vdo.d32;

                                // pd_printf("PassiveCableVDO:\n");
                                // pd_printf("  USBHighestSpeed: %d\n", vdo.PassiveCableVDO.USBHighestSpeed);
                                // pd_printf("  VBUSCurrentHandling: %d\n", vdo.PassiveCableVDO.VBUSCurrentHandling);
                                // pd_printf("  MaxVBUSVoltage: %d\n", vdo.PassiveCableVDO.MaxVBUSVoltage);
                                // pd_printf("  CableTerminationType: %d\n", vdo.PassiveCableVDO.CableTerminationType);
                                // pd_printf("  CableLatency: %d\n", vdo.PassiveCableVDO.CableLatency);
                                // pd_printf("  EPRCapable: %d\n", vdo.PassiveCableVDO.EPRCapable);
                                // pd_printf("  USBTypeCPlug: %d\n", vdo.PassiveCableVDO.USBTypeCPlug);
                                // pd_printf("  VDOVersion: %d\n", vdo.PassiveCableVDO.VDOVersion);
                                // pd_printf("  FirmwareVersion: %d\n", vdo.PassiveCableVDO.FirmwareVersion);
                                // pd_printf("  HWVersion: %d\n", vdo.PassiveCableVDO.HWVersion);

                                usbpd_sink_phy_send_data(usbpd_tx_buffer, (2 + 5 * 4), UPD_SOP1);
                                break;
                            }
                            case 2:  // Discover SVIDs
                            default: {
                                break;
                            }
                        }
                    }
                    break;
                }
                default: {
                    break;
                }
            }
        }
    }
#endif
}

/******************************************************************************
 * Interrupt Handler
 *****************************************************************************/

void USBPD_IRQHandler(void) __attribute__((interrupt("WCH-Interrupt-fast")));
void USBPD_IRQHandler(void) {
    if (USBPD->STATUS & IF_RX_ACT) {
        USBPD->STATUS |= IF_RX_ACT;

        if (USBPD->BMC_BYTE_CNT >= (2 /*Header*/)) {
            if ((USBPD->STATUS & BMC_AUX_Mask) == BMC_AUX_SOP0) {  //  SOP0
                usbpd_sink_protocol_analysis_sop0(usbpd_rx_buffer, USBPD->BMC_BYTE_CNT);
            }
            if ((USBPD->STATUS & BMC_AUX_Mask) == BMC_AUX_SOP1_HRST) {  //  SOP1 用于实现模拟 E-Marker
                usbpd_sink_protocol_analysis_sop1(usbpd_rx_buffer, USBPD->BMC_BYTE_CNT);
            }
        }
    }

    if (USBPD->STATUS & IF_TX_END) {
        USBPD->STATUS |= IF_TX_END;
        usbpd_sink_rx_mode();
    }

