0wQ/CH32X035-PD-Tester/lib/usb_pd/usbpd_sink.c
    if (USBPD->STATUS & IF_RX_RESET) {
        USBPD->STATUS |= IF_RX_RESET;
        usbpd_sink_state_reset();
    }
}

void TIM3_IRQHandler(void) __attribute__((interrupt("WCH-Interrupt-fast")));
void TIM3_IRQHandler(void) {
    TIM_ClearITPendingBit(TIM3, TIM_IT_Update);

    // tSinkEPRKeepAlive timeout 处理
    if (pd_control_g.is_epr_ready) {
        pd_control_g.epr_keepalive_timer++;

        // 在某些状态需要跳过 keep alive，在错误的时机发送可能 reset
        if (pd_control_g.pd_state == PD_STATE_IDLE) {
            if (pd_control_g.epr_keepalive_timer >= tSinkEPRKeepAlive) {
                pd_control_g.epr_keepalive_timer = 0;
                usbpd_sink_epr_keep_alive();
            }
        }
    }

    // tPPSRequest timeout 处理
    USBPD_PDO_Type_t pdo_type;
    USBPD_APDO_Subtype_t apdo_subtype;
    usbpd_sink_get_current_pdo_type(&pdo_type, &apdo_subtype);
    // 判断 spr pps
    if (pdo_type == PDO_TYPE_APDO && apdo_subtype == APDO_TYPE_SPR_PPS && !pd_control_g.is_epr_ready) {
        pd_control_g.pps_periodic_timer++;
        if (pd_control_g.pd_state == PD_STATE_IDLE) {
            if (pd_control_g.pps_periodic_timer >= tPPSRequest) {
                pd_control_g.pps_periodic_timer = 0;
                pd_control_g.pd_state = pd_control_g.is_epr_ready ? PD_STATE_SEND_EPR_REQUEST : PD_STATE_SEND_SPR_REQUEST;
            }
        }
    } else {
        pd_control_g.pps_periodic_timer = 0;
    }

    // 在 PD_STATE_CHECK_CONNECT 状态时检测 CC 连接
    if (pd_control_g.pd_state == PD_STATE_CHECK_CONNECT) {
        USBPD_CC_State_t cc_line = usbpd_sink_check_cc_connect();
        switch (cc_line) {
            case USBPD_CC1: {
                pd_control_g.cc2_connect_times = 0;
                pd_control_g.cc1_connect_times++;
                if (pd_control_g.cc1_connect_times >= 2) {
                    pd_control_g.cc1_connect_times = 0;
                    pd_control_g.pd_state = PD_STATE_CONNECT;
                    USBPD->CONFIG &= ~CC_SEL;
                    pd_printf("Attach: CC1\n");
                }
                break;
            }
            case USBPD_CC2: {
                pd_control_g.cc1_connect_times = 0;
                pd_control_g.cc2_connect_times++;
                if (pd_control_g.cc2_connect_times >= 2) {
                    pd_control_g.cc2_connect_times = 0;
                    pd_control_g.pd_state = PD_STATE_CONNECT;
                    USBPD->CONFIG |= CC_SEL;
                    pd_printf("Attach: CC2\n");
                }
                break;
            }
            case USBPD_CCNONE: {
                pd_control_g.cc1_connect_times = 0;
                pd_control_g.cc2_connect_times = 0;
                break;
            }
        }
    }

    // 处理状态机
    usbpd_sink_state_process();
}

/******************************************************************************
 * Helper Function
 *****************************************************************************/

void usbpd_sink_debug_available_pdos(void) {
    pd_printf("\nSource Capabilities Summary:\n");
    pd_printf("  Total PDOs: %d\n", pd_control_g.available_pdos.pdo_count);
    pd_printf("  EPR Status: %s\n", pd_control_g.is_epr_ready ? "Ready" : "Not Ready");
    pd_printf("  Source EPR Support: %s\n", pd_control_g.source_epr_capable ? "Yes" : "No");
    pd_printf("  Source Power Data Objects:\n");

    for (uint8_t i = 0; i < pd_control_g.available_pdos.pdo_count; i++) {
        const pd_pdo_t *pdo = &pd_control_g.available_pdos.pdo[i];
        pd_printf("  PDO #%d [RAW:0x%08x]: ", pdo->position, pdo->raw);

        switch (pdo->pdo_type) {
            case PDO_TYPE_FIXED_SUPPLY: {
                pd_printf("%s Fixed - %dmV, %dmA%s\n",
                          pdo->fixed.voltage <= 20000 ? "SPR" : "EPR",
                          pdo->fixed.voltage,
                          pdo->fixed.current,
                          pdo->fixed.epr_capable ? " (EPR Capable)" : "");
                break;
            }
            default: {
                // 不支持的 PDO 类型
                pd_printf("Unsupported Type\n");
                break;
            }
        }
    }
    pd_printf("\n");
}

const pd_available_pdos_t *usbpd_sink_get_available_pdos(void) {
    return &pd_control_g.available_pdos;
}

uint8_t usbpd_sink_get_position(void) {
    return pd_control_g.is_ready ? pd_control_g.pdo_pos : 0;
}

bool usbpd_sink_get_current_pdo_type(USBPD_PDO_Type_t *pdo_type, USBPD_APDO_Subtype_t *apdo_subtype) {
    // 获取当前 position
    uint8_t position = usbpd_sink_get_position();
    if (position == 0) {
        return false;
    }
    // 根据 position 查找 pdo
    for (uint8_t i = 0; i < pd_control_g.available_pdos.pdo_count; i++) {
        if (pd_control_g.available_pdos.pdo[i].position == position) {
            *pdo_type = pd_control_g.available_pdos.pdo[i].pdo_type;
            *apdo_subtype = pd_control_g.available_pdos.pdo[i].apdo_subtype;
            return true;
        }
    }
    return false;
}